/* automatically generated by rust-bindgen 0.72.1 */

pub const __BITS_PER_LONG: u32 = 64;
pub const __BITS_PER_LONG_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const KVM_VMI_EVENT_MEM_ACCESS: u32 = 0;
pub const KVM_VMI_EVENT_CR: u32 = 1;
pub const KVM_VMI_EVENT_MSR: u32 = 2;
pub const KVM_VMI_EVENT_CPUID: u32 = 3;
pub const KVM_VMI_EVENT_BREAKPOINT: u32 = 4;
pub const KVM_VMI_EVENT_SINGLESTEP: u32 = 5;
pub const KVM_VMI_EVENT_DEBUG: u32 = 6;
pub const KVM_VMI_EVENT_DESC_ACCESS: u32 = 7;
pub const KVM_VMI_EVENT_INTERRUPT: u32 = 8;
pub const KVM_VMI_EVENT_IO: u32 = 9;
pub const KVM_VMI_NUM_EVENTS: u32 = 10;
pub const KVM_VMI_ACCESS_R: u32 = 1;
pub const KVM_VMI_ACCESS_W: u32 = 2;
pub const KVM_VMI_ACCESS_X: u32 = 4;
pub const KVM_VMI_ACCESS_RWX: u32 = 7;
pub const KVM_VMI_ACCESS_DEFAULT: u32 = 255;
pub const KVM_VMI_DESC_GDTR: u32 = 0;
pub const KVM_VMI_DESC_IDTR: u32 = 1;
pub const KVM_VMI_DESC_LDTR: u32 = 2;
pub const KVM_VMI_DESC_TR: u32 = 3;
pub const KVM_VMI_CR0: u32 = 0;
pub const KVM_VMI_CR3: u32 = 3;
pub const KVM_VMI_CR4: u32 = 4;
pub const KVM_VMI_XCR0: u32 = 64;
pub const KVM_VMI_SHADOW_GFN_BASE: u64 = 281474943156224;
pub const KVM_VMI_EVENT_ENABLE: u32 = 1;
pub const KVM_VMI_SINGLESTEP_START: u32 = 2;
pub const KVM_VMI_RESPONSE_ALLOW: u32 = 0;
pub const KVM_VMI_RESPONSE_DENY: u32 = 1;
pub const KVM_VMI_RESPONSE_SET_REGS: u32 = 2;
pub const KVM_VMI_RESPONSE_SINGLESTEP: u32 = 4;
pub const KVM_VMI_RESPONSE_SINGLESTEP_FAST: u32 = 8;
pub const KVM_VMI_RESPONSE_SWITCH_VIEW: u32 = 16;
pub const KVM_VMI_RESPONSE_EMULATE: u32 = 32;
pub const KVM_VMI_RESPONSE_REINJECT: u32 = 64;
pub const KVM_VMI_EVENT_TYPE_EXT_INT: u32 = 0;
pub const KVM_VMI_EVENT_TYPE_NMI: u32 = 2;
pub const KVM_VMI_EVENT_TYPE_HW_EXCEPT: u32 = 3;
pub const KVM_VMI_EVENT_TYPE_SW_INT: u32 = 4;
pub const KVM_VMI_EVENT_TYPE_PRIV_SW_INT: u32 = 5;
pub const KVM_VMI_EVENT_TYPE_SW_EXCEPT: u32 = 6;
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_uoff_t = ::std::os::raw::c_ulonglong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[doc = " struct kvm_vmi_view - Alternate memory view descriptor\n @view_id: View identifier. OUT on create (assigned by kernel), IN on destroy.\n           View 0 is always the default (host) view and cannot be created/destroyed.\n @flags: Reserved, must be zero.\n @default_access: Default R/W/X permissions for lazily-populated entries.\n                  Combination of KVM_VMI_ACCESS_R/W/X flags.\n @pad: Reserved padding, must be zero."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_view {
    pub view_id: __u32,
    pub flags: __u32,
    pub default_access: __u8,
    pub pad: [__u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_view"][::std::mem::size_of::<kvm_vmi_view>() - 16usize];
    ["Alignment of kvm_vmi_view"][::std::mem::align_of::<kvm_vmi_view>() - 4usize];
    ["Offset of field: kvm_vmi_view::view_id"]
        [::std::mem::offset_of!(kvm_vmi_view, view_id) - 0usize];
    ["Offset of field: kvm_vmi_view::flags"][::std::mem::offset_of!(kvm_vmi_view, flags) - 4usize];
    ["Offset of field: kvm_vmi_view::default_access"]
        [::std::mem::offset_of!(kvm_vmi_view, default_access) - 8usize];
    ["Offset of field: kvm_vmi_view::pad"][::std::mem::offset_of!(kvm_vmi_view, pad) - 9usize];
};
#[doc = " struct kvm_vmi_mem_access - Memory access permissions for a view\n @view_id: Target view.\n @nr: Number of GFNs to set (1 for single-GFN operation).\n @access: For single-GFN: combination of KVM_VMI_ACCESS_R/W/X flags.\n @pad: Reserved padding, must be zero.\n @gfn: For single-GFN operation (nr==1): the guest frame number.\n @gfns_uaddr: For batch operation (nr>1): userspace pointer to __u64 array of GFNs.\n @accesses_uaddr: For batch operation (nr>1): userspace pointer to __u8 array of access flags."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_mem_access {
    pub view_id: __u32,
    pub nr: __u32,
    pub access: __u8,
    pub pad: [__u8; 3usize],
    pub gfn: __u64,
    pub gfns_uaddr: __u64,
    pub accesses_uaddr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_mem_access"][::std::mem::size_of::<kvm_vmi_mem_access>() - 40usize];
    ["Alignment of kvm_vmi_mem_access"][::std::mem::align_of::<kvm_vmi_mem_access>() - 8usize];
    ["Offset of field: kvm_vmi_mem_access::view_id"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, view_id) - 0usize];
    ["Offset of field: kvm_vmi_mem_access::nr"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, nr) - 4usize];
    ["Offset of field: kvm_vmi_mem_access::access"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, access) - 8usize];
    ["Offset of field: kvm_vmi_mem_access::pad"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, pad) - 9usize];
    ["Offset of field: kvm_vmi_mem_access::gfn"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, gfn) - 16usize];
    ["Offset of field: kvm_vmi_mem_access::gfns_uaddr"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, gfns_uaddr) - 24usize];
    ["Offset of field: kvm_vmi_mem_access::accesses_uaddr"]
        [::std::mem::offset_of!(kvm_vmi_mem_access, accesses_uaddr) - 32usize];
};
#[doc = " struct kvm_vmi_change_gfn - Remap a GFN in an alternate view\n @view_id: Target view (must not be 0).\n @pad: Reserved padding, must be zero.\n @old_gfn: The GFN whose mapping to override.\n @new_gfn: The GFN whose backing page should be used instead.\n           Set to KVM_VMI_INVALID_GFN to revert to host mapping."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_change_gfn {
    pub view_id: __u32,
    pub pad: __u32,
    pub old_gfn: __u64,
    pub new_gfn: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_change_gfn"][::std::mem::size_of::<kvm_vmi_change_gfn>() - 24usize];
    ["Alignment of kvm_vmi_change_gfn"][::std::mem::align_of::<kvm_vmi_change_gfn>() - 8usize];
    ["Offset of field: kvm_vmi_change_gfn::view_id"]
        [::std::mem::offset_of!(kvm_vmi_change_gfn, view_id) - 0usize];
    ["Offset of field: kvm_vmi_change_gfn::pad"]
        [::std::mem::offset_of!(kvm_vmi_change_gfn, pad) - 4usize];
    ["Offset of field: kvm_vmi_change_gfn::old_gfn"]
        [::std::mem::offset_of!(kvm_vmi_change_gfn, old_gfn) - 8usize];
    ["Offset of field: kvm_vmi_change_gfn::new_gfn"]
        [::std::mem::offset_of!(kvm_vmi_change_gfn, new_gfn) - 16usize];
};
#[doc = " struct kvm_vmi_vcpu_view - vCPU view state\n @view_id: View identifier.\n @pad: Reserved padding, must be zero."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_vcpu_view {
    pub view_id: __u32,
    pub pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_vcpu_view"][::std::mem::size_of::<kvm_vmi_vcpu_view>() - 8usize];
    ["Alignment of kvm_vmi_vcpu_view"][::std::mem::align_of::<kvm_vmi_vcpu_view>() - 4usize];
    ["Offset of field: kvm_vmi_vcpu_view::view_id"]
        [::std::mem::offset_of!(kvm_vmi_vcpu_view, view_id) - 0usize];
    ["Offset of field: kvm_vmi_vcpu_view::pad"]
        [::std::mem::offset_of!(kvm_vmi_vcpu_view, pad) - 4usize];
};
#[doc = " struct kvm_vmi_event_control - Per-vCPU event monitoring control\n @event: Event type (KVM_VMI_EVENT_*).\n @flags: KVM_VMI_EVENT_ENABLE to enable, 0 to disable.\n @cr.index: CR index (KVM_VMI_CR0/CR3/CR4/XCR0).\n @cr.onchangeonly: If nonzero, only report when the value actually changes.\n @cr.bitmask: Only report when (old_val ^ new_val) & bitmask is nonzero.\n              Set to ~0ULL to report all changes.\n @msr.msr: MSR index to monitor.\n @msr.onchangeonly: If nonzero, only report when the value actually changes.\n @pad: Generic padding for future event-specific options."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_vmi_event_control {
    pub event: __u32,
    pub flags: __u32,
    pub __bindgen_anon_1: kvm_vmi_event_control__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_vmi_event_control__bindgen_ty_1 {
    pub cr: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1,
    pub msr: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2,
    pub pad: [__u8; 24usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1 {
    pub index: __u8,
    pub onchangeonly: __u8,
    pub pad: [__u8; 6usize],
    pub bitmask: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1::index"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1, index) - 0usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1::onchangeonly"][::std::mem::offset_of!(
        kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1,
        onchangeonly
    )
        - 1usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1, pad) - 2usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1::bitmask"][::std::mem::offset_of!(
        kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_1,
        bitmask
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2 {
    pub msr: __u32,
    pub onchangeonly: __u8,
    pub pad: [__u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2::msr"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2, msr) - 0usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2::onchangeonly"][::std::mem::offset_of!(
        kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2,
        onchangeonly
    )
        - 4usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2::pad"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1__bindgen_ty_2, pad) - 5usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_event_control__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_event_control__bindgen_ty_1>() - 24usize];
    ["Alignment of kvm_vmi_event_control__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_event_control__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1::cr"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1, cr) - 0usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1::msr"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1, msr) - 0usize];
    ["Offset of field: kvm_vmi_event_control__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_vmi_event_control__bindgen_ty_1, pad) - 0usize];
};
impl Default for kvm_vmi_event_control__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_event_control"][::std::mem::size_of::<kvm_vmi_event_control>() - 32usize];
    ["Alignment of kvm_vmi_event_control"]
        [::std::mem::align_of::<kvm_vmi_event_control>() - 8usize];
    ["Offset of field: kvm_vmi_event_control::event"]
        [::std::mem::offset_of!(kvm_vmi_event_control, event) - 0usize];
    ["Offset of field: kvm_vmi_event_control::flags"]
        [::std::mem::offset_of!(kvm_vmi_event_control, flags) - 4usize];
};
impl Default for kvm_vmi_event_control {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct kvm_vmi_regs - Register snapshot embedded in ring events\n\n Contains the most commonly needed registers for VMI. For exotic\n registers (FPU, XSAVE, debug regs), the agent can call standard\n KVM ioctls (KVM_GET_FPU, etc.) since vcpu->mutex is released."]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_regs {
    pub rax: __u64,
    pub rbx: __u64,
    pub rcx: __u64,
    pub rdx: __u64,
    pub rsi: __u64,
    pub rdi: __u64,
    pub rbp: __u64,
    pub rsp: __u64,
    pub r8: __u64,
    pub r9: __u64,
    pub r10: __u64,
    pub r11: __u64,
    pub r12: __u64,
    pub r13: __u64,
    pub r14: __u64,
    pub r15: __u64,
    pub rip: __u64,
    pub rflags: __u64,
    pub cr0: __u64,
    pub cr3: __u64,
    pub cr4: __u64,
    pub xcr0: __u64,
    pub cs: kvm_vmi_regs__bindgen_ty_1,
    pub ss: kvm_vmi_regs__bindgen_ty_1,
    pub ds: kvm_vmi_regs__bindgen_ty_1,
    pub es: kvm_vmi_regs__bindgen_ty_1,
    pub fs: kvm_vmi_regs__bindgen_ty_1,
    pub gs: kvm_vmi_regs__bindgen_ty_1,
    pub sysenter_cs: __u64,
    pub sysenter_esp: __u64,
    pub sysenter_eip: __u64,
    pub shadow_gs: __u64,
    pub msr_star: __u64,
    pub msr_lstar: __u64,
    pub msr_cstar: __u64,
    pub msr_syscall_mask: __u64,
    pub msr_efer: __u64,
    pub msr_tsc_aux: __u64,
    pub msr_kernel_gs_base: __u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_regs__bindgen_ty_1 {
    pub base: __u64,
    pub limit: __u32,
    pub selector: __u16,
    pub ar: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_regs__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_regs__bindgen_ty_1>() - 16usize];
    ["Alignment of kvm_vmi_regs__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_regs__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_regs__bindgen_ty_1::base"]
        [::std::mem::offset_of!(kvm_vmi_regs__bindgen_ty_1, base) - 0usize];
    ["Offset of field: kvm_vmi_regs__bindgen_ty_1::limit"]
        [::std::mem::offset_of!(kvm_vmi_regs__bindgen_ty_1, limit) - 8usize];
    ["Offset of field: kvm_vmi_regs__bindgen_ty_1::selector"]
        [::std::mem::offset_of!(kvm_vmi_regs__bindgen_ty_1, selector) - 12usize];
    ["Offset of field: kvm_vmi_regs__bindgen_ty_1::ar"]
        [::std::mem::offset_of!(kvm_vmi_regs__bindgen_ty_1, ar) - 14usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_regs"][::std::mem::size_of::<kvm_vmi_regs>() - 360usize];
    ["Alignment of kvm_vmi_regs"][::std::mem::align_of::<kvm_vmi_regs>() - 8usize];
    ["Offset of field: kvm_vmi_regs::rax"][::std::mem::offset_of!(kvm_vmi_regs, rax) - 0usize];
    ["Offset of field: kvm_vmi_regs::rbx"][::std::mem::offset_of!(kvm_vmi_regs, rbx) - 8usize];
    ["Offset of field: kvm_vmi_regs::rcx"][::std::mem::offset_of!(kvm_vmi_regs, rcx) - 16usize];
    ["Offset of field: kvm_vmi_regs::rdx"][::std::mem::offset_of!(kvm_vmi_regs, rdx) - 24usize];
    ["Offset of field: kvm_vmi_regs::rsi"][::std::mem::offset_of!(kvm_vmi_regs, rsi) - 32usize];
    ["Offset of field: kvm_vmi_regs::rdi"][::std::mem::offset_of!(kvm_vmi_regs, rdi) - 40usize];
    ["Offset of field: kvm_vmi_regs::rbp"][::std::mem::offset_of!(kvm_vmi_regs, rbp) - 48usize];
    ["Offset of field: kvm_vmi_regs::rsp"][::std::mem::offset_of!(kvm_vmi_regs, rsp) - 56usize];
    ["Offset of field: kvm_vmi_regs::r8"][::std::mem::offset_of!(kvm_vmi_regs, r8) - 64usize];
    ["Offset of field: kvm_vmi_regs::r9"][::std::mem::offset_of!(kvm_vmi_regs, r9) - 72usize];
    ["Offset of field: kvm_vmi_regs::r10"][::std::mem::offset_of!(kvm_vmi_regs, r10) - 80usize];
    ["Offset of field: kvm_vmi_regs::r11"][::std::mem::offset_of!(kvm_vmi_regs, r11) - 88usize];
    ["Offset of field: kvm_vmi_regs::r12"][::std::mem::offset_of!(kvm_vmi_regs, r12) - 96usize];
    ["Offset of field: kvm_vmi_regs::r13"][::std::mem::offset_of!(kvm_vmi_regs, r13) - 104usize];
    ["Offset of field: kvm_vmi_regs::r14"][::std::mem::offset_of!(kvm_vmi_regs, r14) - 112usize];
    ["Offset of field: kvm_vmi_regs::r15"][::std::mem::offset_of!(kvm_vmi_regs, r15) - 120usize];
    ["Offset of field: kvm_vmi_regs::rip"][::std::mem::offset_of!(kvm_vmi_regs, rip) - 128usize];
    ["Offset of field: kvm_vmi_regs::rflags"]
        [::std::mem::offset_of!(kvm_vmi_regs, rflags) - 136usize];
    ["Offset of field: kvm_vmi_regs::cr0"][::std::mem::offset_of!(kvm_vmi_regs, cr0) - 144usize];
    ["Offset of field: kvm_vmi_regs::cr3"][::std::mem::offset_of!(kvm_vmi_regs, cr3) - 152usize];
    ["Offset of field: kvm_vmi_regs::cr4"][::std::mem::offset_of!(kvm_vmi_regs, cr4) - 160usize];
    ["Offset of field: kvm_vmi_regs::xcr0"][::std::mem::offset_of!(kvm_vmi_regs, xcr0) - 168usize];
    ["Offset of field: kvm_vmi_regs::cs"][::std::mem::offset_of!(kvm_vmi_regs, cs) - 176usize];
    ["Offset of field: kvm_vmi_regs::ss"][::std::mem::offset_of!(kvm_vmi_regs, ss) - 192usize];
    ["Offset of field: kvm_vmi_regs::ds"][::std::mem::offset_of!(kvm_vmi_regs, ds) - 208usize];
    ["Offset of field: kvm_vmi_regs::es"][::std::mem::offset_of!(kvm_vmi_regs, es) - 224usize];
    ["Offset of field: kvm_vmi_regs::fs"][::std::mem::offset_of!(kvm_vmi_regs, fs) - 240usize];
    ["Offset of field: kvm_vmi_regs::gs"][::std::mem::offset_of!(kvm_vmi_regs, gs) - 256usize];
    ["Offset of field: kvm_vmi_regs::sysenter_cs"]
        [::std::mem::offset_of!(kvm_vmi_regs, sysenter_cs) - 272usize];
    ["Offset of field: kvm_vmi_regs::sysenter_esp"]
        [::std::mem::offset_of!(kvm_vmi_regs, sysenter_esp) - 280usize];
    ["Offset of field: kvm_vmi_regs::sysenter_eip"]
        [::std::mem::offset_of!(kvm_vmi_regs, sysenter_eip) - 288usize];
    ["Offset of field: kvm_vmi_regs::shadow_gs"]
        [::std::mem::offset_of!(kvm_vmi_regs, shadow_gs) - 296usize];
    ["Offset of field: kvm_vmi_regs::msr_star"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_star) - 304usize];
    ["Offset of field: kvm_vmi_regs::msr_lstar"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_lstar) - 312usize];
    ["Offset of field: kvm_vmi_regs::msr_cstar"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_cstar) - 320usize];
    ["Offset of field: kvm_vmi_regs::msr_syscall_mask"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_syscall_mask) - 328usize];
    ["Offset of field: kvm_vmi_regs::msr_efer"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_efer) - 336usize];
    ["Offset of field: kvm_vmi_regs::msr_tsc_aux"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_tsc_aux) - 344usize];
    ["Offset of field: kvm_vmi_regs::msr_kernel_gs_base"]
        [::std::mem::offset_of!(kvm_vmi_regs, msr_kernel_gs_base) - 352usize];
};
#[doc = " struct kvm_vmi_ring_header - Ring page header\n @req_prod: Producer index (kernel increments after writing event)\n @req_cons: Consumer index (agent increments after reading event)\n @num_slots: Number of event slots in this ring\n @pad: Reserved padding"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_header {
    pub req_prod: __u32,
    pub req_cons: __u32,
    pub num_slots: __u32,
    pub pad: [__u32; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_header"][::std::mem::size_of::<kvm_vmi_ring_header>() - 64usize];
    ["Alignment of kvm_vmi_ring_header"][::std::mem::align_of::<kvm_vmi_ring_header>() - 4usize];
    ["Offset of field: kvm_vmi_ring_header::req_prod"]
        [::std::mem::offset_of!(kvm_vmi_ring_header, req_prod) - 0usize];
    ["Offset of field: kvm_vmi_ring_header::req_cons"]
        [::std::mem::offset_of!(kvm_vmi_ring_header, req_cons) - 4usize];
    ["Offset of field: kvm_vmi_ring_header::num_slots"]
        [::std::mem::offset_of!(kvm_vmi_ring_header, num_slots) - 8usize];
    ["Offset of field: kvm_vmi_ring_header::pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_header, pad) - 12usize];
};
#[doc = " struct kvm_vmi_ring_event - Ring event slot\n\n Written by kernel (header + event union + regs), response area\n written by agent before signaling ack_fd."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_vmi_ring_event {
    pub type_: __u32,
    pub vcpu_id: __u32,
    pub flags: __u32,
    pub _reserved: __u32,
    pub u: kvm_vmi_ring_event__bindgen_ty_1,
    pub regs: kvm_vmi_regs,
    pub response: __u32,
    pub view_id: __u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_vmi_ring_event__bindgen_ty_1 {
    pub cr: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1,
    pub msr: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2,
    pub cpuid: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3,
    pub mem_access: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4,
    pub breakpoint: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5,
    pub singlestep: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6,
    pub desc_access: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7,
    pub debug: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8,
    pub interrupt: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9,
    pub io: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10,
    pub pad: [__u8; 32usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1 {
    pub index: __u32,
    pub _pad: __u32,
    pub old_value: __u64,
    pub new_value: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1::index"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1, index) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1, _pad) - 4usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1::old_value"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1,
        old_value
    ) - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1::new_value"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_1,
        new_value
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2 {
    pub index: __u32,
    pub _pad: __u32,
    pub old_value: __u64,
    pub new_value: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2::index"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2, index) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2, _pad) - 4usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2::old_value"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2,
        old_value
    ) - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2::new_value"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_2,
        new_value
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3 {
    pub leaf: __u32,
    pub subleaf: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3>() - 4usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3::leaf"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3, leaf) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3::subleaf"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_3, subleaf) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4 {
    pub gpa: __u64,
    pub access: __u32,
    pub _pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4::gpa"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4, gpa) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4::access"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4, access) - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_4, _pad) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5 {
    pub gpa: __u64,
    pub insn_len: __u32,
    pub _pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5>() - 16usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5::gpa"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5, gpa) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5::insn_len"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5, insn_len) - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_5, _pad) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6 {
    pub gpa: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6::gpa"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_6, gpa) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7 {
    pub descriptor: __u8,
    pub is_write: __u8,
    pub _pad: [__u8; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7>() - 8usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7>() - 1usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7::descriptor"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7,
        descriptor
    ) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7::is_write"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7, is_write) - 1usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_7, _pad) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8 {
    pub pending_dbg: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8>() - 8usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8::pending_dbg"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_8,
        pending_dbg
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9 {
    pub vector: __u32,
    pub error_code: __u32,
    pub cr2: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9>() - 16usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9::vector"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9, vector) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9::error_code"][::std::mem::offset_of!(
        kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9,
        error_code
    ) - 4usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9::cr2"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_9, cr2) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10 {
    pub port: __u16,
    pub bytes: __u8,
    pub in_: __u8,
    pub string: __u8,
    pub _pad: [__u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10>() - 8usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10>() - 2usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10::port"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10, port) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10::bytes"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10, bytes) - 2usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10::in_"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10, in_) - 3usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10::string"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10, string) - 4usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10::_pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1__bindgen_ty_10, _pad) - 5usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_ring_event__bindgen_ty_1>() - 32usize];
    ["Alignment of kvm_vmi_ring_event__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_ring_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::cr"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, cr) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::msr"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, msr) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::cpuid"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, cpuid) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::mem_access"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, mem_access) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::breakpoint"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, breakpoint) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::singlestep"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, singlestep) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::desc_access"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, desc_access) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::debug"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, debug) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::interrupt"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, interrupt) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::io"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, io) - 0usize];
    ["Offset of field: kvm_vmi_ring_event__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_vmi_ring_event__bindgen_ty_1, pad) - 0usize];
};
impl Default for kvm_vmi_ring_event__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_ring_event"][::std::mem::size_of::<kvm_vmi_ring_event>() - 416usize];
    ["Alignment of kvm_vmi_ring_event"][::std::mem::align_of::<kvm_vmi_ring_event>() - 8usize];
    ["Offset of field: kvm_vmi_ring_event::type_"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, type_) - 0usize];
    ["Offset of field: kvm_vmi_ring_event::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, vcpu_id) - 4usize];
    ["Offset of field: kvm_vmi_ring_event::flags"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, flags) - 8usize];
    ["Offset of field: kvm_vmi_ring_event::_reserved"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, _reserved) - 12usize];
    ["Offset of field: kvm_vmi_ring_event::u"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, u) - 16usize];
    ["Offset of field: kvm_vmi_ring_event::regs"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, regs) - 48usize];
    ["Offset of field: kvm_vmi_ring_event::response"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, response) - 408usize];
    ["Offset of field: kvm_vmi_ring_event::view_id"]
        [::std::mem::offset_of!(kvm_vmi_ring_event, view_id) - 412usize];
};
impl Default for kvm_vmi_ring_event {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct kvm_vmi_setup_ring - Ring setup parameters\n @vcpu_id: Target vCPU\n @flags: Reserved, must be 0\n @event_fd: IN: eventfd for kernel -> agent event notification\n @ack_fd: IN: eventfd for agent -> kernel response notification\n @ring_fd: OUT: fd to mmap for the ring page (created by kernel)\n @pad: Reserved padding"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_setup_ring {
    pub vcpu_id: __u32,
    pub flags: __u32,
    pub event_fd: __s32,
    pub ack_fd: __s32,
    pub ring_fd: __s32,
    pub pad: __s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_setup_ring"][::std::mem::size_of::<kvm_vmi_setup_ring>() - 24usize];
    ["Alignment of kvm_vmi_setup_ring"][::std::mem::align_of::<kvm_vmi_setup_ring>() - 4usize];
    ["Offset of field: kvm_vmi_setup_ring::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_setup_ring::flags"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, flags) - 4usize];
    ["Offset of field: kvm_vmi_setup_ring::event_fd"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, event_fd) - 8usize];
    ["Offset of field: kvm_vmi_setup_ring::ack_fd"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, ack_fd) - 12usize];
    ["Offset of field: kvm_vmi_setup_ring::ring_fd"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, ring_fd) - 16usize];
    ["Offset of field: kvm_vmi_setup_ring::pad"]
        [::std::mem::offset_of!(kvm_vmi_setup_ring, pad) - 20usize];
};
#[doc = " struct kvm_vmi_control_event - Event control via vmi_fd\n @vcpu_id: Target vCPU\n @event: Event type (KVM_VMI_EVENT_*)\n @enable: 1 to enable, 0 to disable\n @flags: KVM_VMI_EVENT_* flags\n @param: Event-specific parameter\n         For CR events: cr.index, cr.onchangeonly, cr.bitmask\n         For MSR events: msr.msr, msr.onchangeonly"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct kvm_vmi_control_event {
    pub vcpu_id: __u32,
    pub event: __u32,
    pub enable: __u32,
    pub flags: __u32,
    pub __bindgen_anon_1: kvm_vmi_control_event__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union kvm_vmi_control_event__bindgen_ty_1 {
    pub cr: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1,
    pub msr: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2,
    pub pad: [__u8; 24usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1 {
    pub index: __u8,
    pub onchangeonly: __u8,
    pub pad: [__u8; 6usize],
    pub bitmask: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1::index"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1, index) - 0usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1::onchangeonly"][::std::mem::offset_of!(
        kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1,
        onchangeonly
    )
        - 1usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1, pad) - 2usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1::bitmask"][::std::mem::offset_of!(
        kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_1,
        bitmask
    ) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2 {
    pub msr: __u32,
    pub onchangeonly: __u8,
    pub pad: [__u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2::msr"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2, msr) - 0usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2::onchangeonly"][::std::mem::offset_of!(
        kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2,
        onchangeonly
    )
        - 4usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2::pad"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1__bindgen_ty_2, pad) - 5usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_control_event__bindgen_ty_1"]
        [::std::mem::size_of::<kvm_vmi_control_event__bindgen_ty_1>() - 24usize];
    ["Alignment of kvm_vmi_control_event__bindgen_ty_1"]
        [::std::mem::align_of::<kvm_vmi_control_event__bindgen_ty_1>() - 8usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1::cr"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1, cr) - 0usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1::msr"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1, msr) - 0usize];
    ["Offset of field: kvm_vmi_control_event__bindgen_ty_1::pad"]
        [::std::mem::offset_of!(kvm_vmi_control_event__bindgen_ty_1, pad) - 0usize];
};
impl Default for kvm_vmi_control_event__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_control_event"][::std::mem::size_of::<kvm_vmi_control_event>() - 40usize];
    ["Alignment of kvm_vmi_control_event"]
        [::std::mem::align_of::<kvm_vmi_control_event>() - 8usize];
    ["Offset of field: kvm_vmi_control_event::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_control_event, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_control_event::event"]
        [::std::mem::offset_of!(kvm_vmi_control_event, event) - 4usize];
    ["Offset of field: kvm_vmi_control_event::enable"]
        [::std::mem::offset_of!(kvm_vmi_control_event, enable) - 8usize];
    ["Offset of field: kvm_vmi_control_event::flags"]
        [::std::mem::offset_of!(kvm_vmi_control_event, flags) - 12usize];
};
impl Default for kvm_vmi_control_event {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " struct kvm_vmi_switch_view - Switch vCPU view via vmi_fd"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_switch_view {
    pub vcpu_id: __u32,
    pub view_id: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_switch_view"][::std::mem::size_of::<kvm_vmi_switch_view>() - 8usize];
    ["Alignment of kvm_vmi_switch_view"][::std::mem::align_of::<kvm_vmi_switch_view>() - 4usize];
    ["Offset of field: kvm_vmi_switch_view::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_switch_view, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_switch_view::view_id"]
        [::std::mem::offset_of!(kvm_vmi_switch_view, view_id) - 4usize];
};
#[doc = " struct kvm_vmi_vcpu - Generic vCPU identifier for vmi_fd ioctls"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_vcpu {
    pub vcpu_id: __u32,
    pub pad: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_vcpu"][::std::mem::size_of::<kvm_vmi_vcpu>() - 8usize];
    ["Alignment of kvm_vmi_vcpu"][::std::mem::align_of::<kvm_vmi_vcpu>() - 4usize];
    ["Offset of field: kvm_vmi_vcpu::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_vcpu, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_vcpu::pad"][::std::mem::offset_of!(kvm_vmi_vcpu, pad) - 4usize];
};
#[doc = " struct kvm_vmi_inject_event - Inject exception/interrupt/NMI\n @vcpu_id: Target vCPU\n @vector: Interrupt/exception vector (0-255)\n @type: KVM_VMI_EVENT_TYPE_* (matches VMCS interruption type encoding)\n @padding: Must be 0\n @error_code: Exception error code (if has_error is set)\n @has_error: Whether error_code is valid\n @cr2: CR2 value for #PF (vector 14)"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_inject_event {
    pub vcpu_id: __u32,
    pub vector: __u8,
    pub type_: __u8,
    pub padding: __u16,
    pub error_code: __u32,
    pub has_error: __u32,
    pub cr2: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_inject_event"][::std::mem::size_of::<kvm_vmi_inject_event>() - 24usize];
    ["Alignment of kvm_vmi_inject_event"][::std::mem::align_of::<kvm_vmi_inject_event>() - 8usize];
    ["Offset of field: kvm_vmi_inject_event::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_inject_event::vector"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, vector) - 4usize];
    ["Offset of field: kvm_vmi_inject_event::type_"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, type_) - 5usize];
    ["Offset of field: kvm_vmi_inject_event::padding"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, padding) - 6usize];
    ["Offset of field: kvm_vmi_inject_event::error_code"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, error_code) - 8usize];
    ["Offset of field: kvm_vmi_inject_event::has_error"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, has_error) - 12usize];
    ["Offset of field: kvm_vmi_inject_event::cr2"]
        [::std::mem::offset_of!(kvm_vmi_inject_event, cr2) - 16usize];
};
#[doc = " struct kvm_vmi_singlestep - Singlestep control via vmi_fd"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_singlestep {
    pub vcpu_id: __u32,
    pub enable: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_singlestep"][::std::mem::size_of::<kvm_vmi_singlestep>() - 8usize];
    ["Alignment of kvm_vmi_singlestep"][::std::mem::align_of::<kvm_vmi_singlestep>() - 4usize];
    ["Offset of field: kvm_vmi_singlestep::vcpu_id"]
        [::std::mem::offset_of!(kvm_vmi_singlestep, vcpu_id) - 0usize];
    ["Offset of field: kvm_vmi_singlestep::enable"]
        [::std::mem::offset_of!(kvm_vmi_singlestep, enable) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_alloc_gfn {
    pub gfn: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_alloc_gfn"][::std::mem::size_of::<kvm_vmi_alloc_gfn>() - 8usize];
    ["Alignment of kvm_vmi_alloc_gfn"][::std::mem::align_of::<kvm_vmi_alloc_gfn>() - 8usize];
    ["Offset of field: kvm_vmi_alloc_gfn::gfn"]
        [::std::mem::offset_of!(kvm_vmi_alloc_gfn, gfn) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct kvm_vmi_free_gfn {
    pub gfn: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_vmi_free_gfn"][::std::mem::size_of::<kvm_vmi_free_gfn>() - 8usize];
    ["Alignment of kvm_vmi_free_gfn"][::std::mem::align_of::<kvm_vmi_free_gfn>() - 8usize];
    ["Offset of field: kvm_vmi_free_gfn::gfn"]
        [::std::mem::offset_of!(kvm_vmi_free_gfn, gfn) - 0usize];
};
